Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_176-Vimalakirtinirdesa-v1.tmx
Source language: bo
Languages: en

source: ཤིན་ཏུ་མ་གཡོས་པའི་ཕྱིར་ཡང་དག་པ་ཉིད་ཀྱི་མཐའ་ལ་གནས་པ་ཡུལ་དྲུག་ལ་མི་རྟེན་པས་མ་གཡོས་པ།
en: It abides at the reality-limit, for it is utterly without fluctuation. It is immovable, because it is independent of the six objects of sense.

source: །འདི་ནི་འདུས་བྱས་སོ། །འདི་ནི་འདུས་མ་བྱས་སོ།
en: This is compounded and that is uncompounded.

source: །འདི་ནི་འཇིག་རྟེན་པའོ། །འདི་ནི་འཇིག་རྟེན་ལས་འདས་པའོ།
en: This is mundane and that is transcendental.

source: །གང་ནང་དུ་སོ་སོར་རྟོག་པ་ཡང་སྤྱོད་ཡུལ་ལ་བསམས་བཞིན་དུ་སྲིད་པར་སྐྱེ་བར་ཡོངས་སུ་འཛིན་པའང་སྤྱོད་ཡུལ་མ་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: A domain of introspective insight, wherein one does not arrest voluntary reincarnation in the world, such is the domain of the bodhisattva.

source: །འདི་ནི་ཟག་པ་དང་བཅས་པའོ། །འདི་ནི་ཟག་པ་མེད་པའོ།
en: This is defiled and that is immaculate.

source: །དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་སྨྲས་པ།
en: The Licchavi Vimalakīrti declared,

source: སྐྱེས་བུ་དམ་པ་དག་དེ་དེ་བཞིན་ཏེ་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ནོ།
en: “So it is, good sirs! It is as you say.

source: །གང་མི་སྐྱེ་བར་སོ་སོར་རྟོག་པའང་སྤྱོད་ཡུལ་ལ་ངེས་པར་གྱུར་པ་ལ་འཇུག་པའང་སྤྱོད་ཡུལ་མ་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: A domain where one realizes birthlessness, yet does not become destined for the ultimate, such is the domain of the bodhisattva.

source: །གང་འདིར་སྐྱེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་གི་སྙིང་རྗེ་ཆེན་པོ་ཤིན་ཏུ་བརྟན་ནོ།
en: The great compassion of the bodhisattvas who reincarnate here is extremely firm.

source: །གང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡང་སྤྱོད་ཡུལ་ལ་ལྟ་བ་ཐམས་ཅད་ཀྱི་ཡུལ་ཡང་སྤྱོད་ཡུལ་མ་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: Where one sees relativity without entertaining any convictions, there is the domain of the bodhisattva.

source: །དེ་དག་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཚེ་གཅིག་ལ་སེམས་ཅན་གྱི་དོན་ཤིན་ཏུ་མང་དུ་བྱེད་དེ།
en: In a single lifetime in this universe, they accomplish much benefit for living beings.

source: །གང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདུ་འཛི་ཡང་སྤྱོད་ཡུལ་ལ་ཉོན་མོངས་པའི་བག་ལ་ཉལ་ཡང་སྤྱོད་ཡུལ་མ་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: Where one associates with all beings, yet keeps free of all afflictive instincts, there is the domain of the bodhisattva.

source: །གང་དབེན་པ་ཡང་སྤྱོད་ཡུལ་ལ་ལུས་དང་སེམས་ཟད་པའི་གནས་ཀྱང་སྤྱོད་ཡུལ་མ་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: A domain of solitude with no place for the exhaustion of body and mind, such is the domain of the bodhisattva.

source: འཇིག་རྟེན་གྱི་ཁམས་སྤོས་ཐམས་ཅད་ཀྱི་དྲི་མཆོག་དེར་བསྐལ་པ་བརྒྱ་སྟོང་གིས་ཀྱང་སེམས་ཅན་གྱི་དོན་དེ་ལྟར་བྱེད་མི་ནུས་སོ།
en: So much benefit for living beings could not be accomplished in the universe Sarva­gandha­sugandhā even in one hundred thousand eons.

source: །གང་ཁམས་གསུམ་ཡང་སྤྱོད་ཡུལ་ལ་ཆོས་ཀྱི་དབྱིངས་དབྱེ་བར་བྱ་བའང་སྤྱོད་ཡུལ་མ་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of the triple world, yet indivisible from the ultimate realm, such is the domain of the bodhisattva.

source: །གང་སྟོང་པ་ཉིད་ཀྱང་སྤྱོད་ཡུལ་ལ་ཡོན་ཏན་གྱི་རྣམ་པ་ཐམས་ཅད་ཚོལ་བ་ཡང་སྤྱོད་ཡུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of voidness, yet where one cultivates all types of virtues, such is the domain of the bodhisattva.

source: །བཅུ་གང་ཞེ་ན།
en: What are these ten?

source: །གང་མཚན་མ་མེད་པའང་སྤྱོད་ཡུལ་ལ་སེམས་ཅན་རབ་ཏུ་གྲོལ་བར་བྱ་བ་ལ་དམིགས་ཤིང་རྟོག་པའང་སྤྱོད་ཡུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of signlessness, where one keeps in sight the deliverance of all living beings, such is the domain of the bodhisattva.

source: །གང་སྨོན་པ་མེད་པའང་སྤྱོད་ཡུལ་ལ་བསམས་བཞིན་དུ་སྲིད་པའི་འགྲོ་བར་སྟོན་པར་ཡང་སྤྱོད་ཡུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of wishlessness, where one voluntarily manifests lives in the world, such is the domain of the bodhisattva.

source: དབུལ་པོ་རྣམས་ལ་ནི་སྦྱིན་པས་སྡུད་དོ།
en: to win the poor by generosity;

source: །ཚུལ་ཁྲིམས་འཆལ་པ་རྣམས་ལ་ནི་ཚུལ་ཁྲིམས་ཀྱིས་སྡུད་དོ།
en: to win the immoral by morality;

source: །གང་མངོན་པར་འདུ་མི་བྱེད་པའང་སྤྱོད་ཡུལ་ལ་དགེ་བའི་རྩ་བ་ཐམས་ཅད་མངོན་པར་འདུ་བྱེད་པ་རྒྱུན་མི་གཅོད་པ་ཡང་སྤྱོད་ཡུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: “A domain essentially without undertaking, yet where all the roots of virtue are undertaken without interruption, such is the domain of the bodhisattva.

source: །ཁོང་ཁྲོ་བ་རྣམས་ལ་ནི་བཟོད་པས་སྡུད་དོ།
en: to win the hateful by means of tolerance;

source: །གང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཀྱང་སྤྱོད་ཡུལ་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པའི་ཕ་རོལ་ཏུ་འགྲོ་བར་ཡང་སྤྱོད་ཡུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of the six transcendences, where one attains the transcendence of the thoughts and actions of all living beings, such is the domain of the bodhisattva.

source: །ལེ་ལོ་ཅན་རྣམས་ལ་ནི་བརྩོན་འགྲུས་ཀྱིས་སྡུད་དོ།
en: to win the lazy by means of effort;

source: །གང་མངོན་པར་ཤེས་པ་དྲུག་ཀྱང་སྤྱོད་ཡུལ་ལ་ཟག་པ་ཟད་པ་ཡང་སྤྱོད་ཡུལ་མ་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of the six superknowledges, wherein defilements are not exhausted, such is the domain of the bodhisattva.

source: །སེམས་གཡེང་བ་རྣམས་ལ་ནི་བསམ་གཏན་གྱིས་སྡུད་དོ།
en: to win the mentally troubled by means of concentration;

source: །ཤེས་རབ་འཆལ་པ་རྣམས་ལ་ནི་ཤེས་རབ་ཀྱིས་སྡུད་དོ།
en: to win the falsely wise by means of true wisdom;

source: ། གང་དམ་པའི་ཆོས་ལ་གནས་པ་ཡང་སྤྱོད་ཡུལ་ལ་ལམ་ངན་པ་ལ་མི་དམིགས་པའང་སྤྱོད་ཡུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of living by the holy Dharma, without even perceiving any evil paths, such is the domain of the bodhisattva.

source: །མི་ཁོམ་པར་གྱུར་པ་རྣམས་ལ་ནི་མི་ཁོམ་པ་བརྒྱད་ལས་འདའ་བ་སྟོན་ཏོ།
en: to show those suffering from the eight adversities how to rise above them;

source: །གང་ཚད་མེད་པ་བཞི་ལའང་སྤྱོད་ཡུལ་ལ་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེ་བ་ལ་མི་རིག་པའང་སྤྱོད་ཡུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of the four immeasurables, where one does not accept rebirth in the heaven of Brahmā, such is the domain of the bodhisattva.

source: །ཉི་ཚེ་བར་སྤྱོད་པ་རྣམས་ལ་ནི་ཐེག་པ་ཆེན་པོ་སྟོན་ཏོ།
en: to teach the Mahāyāna to those of narrow-minded attitudes;

source: །དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པ་རྣམས་ལ་ནི་དགེ་བའི་རྩ་བས་སྡུད་དོ།
en: to win those who have not produced the roots of virtue by means of the roots of virtue;

source: །གང་རྗེས་སུ་དྲན་པ་དྲུག་ཀྱང་སྤྱོད་ཡུལ་ལ་ཟག་པ་ཐམས་ཅད་ཀྱང་སྤྱོད་ཡུལ་མ་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of the six remembrances, unaffected by any sort of defilement, such is the domain of the bodhisattva.

source: །གང་བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའང་སྤྱོད་ཡུལ་ལ་ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་དབང་གིས་མི་སྐྱེ་བའང་སྤྱོད་ཡུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of contemplation, concentration, and absorption, where one does not reincarnate in the formless realms by force of these concentrations and absorptions, such is the domain of the bodhisattva.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་ཐམས་ཅད་བཟོད་པར་བྱ་སྟེ། དེས་དགེ་བའི་རྩ་བ་ཐམས་ཅད་སེམས་ཅན་ཐམས་ཅད་ལ་གཏང་བར་བྱའོ་སྙམ་པ་དང་།
en: I must bear all the miseries of all living beings and give all my accumulated roots of virtue to all living beings.

source: །གང་དྲན་པ་ཉེ་བར་གཞག་པའང་སྤྱོད་ཡུལ་ལ་ལུས་དང་། ཚོར་བ་དང་། སེམས་དང་། ཆོས་ཀྱང་ཤིན་ཏུ་སྤྱོད་ཡུལ་མ་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of the four foci of mindfulness, where body, sensation, mind, and things are not ultimately of concern, such is the domain of the bodhisattva.

source: འདི་དག་ལས་ནི་ཕན་པ་ཆུང་ཟད་ཀྱང་མི་འཚལ་ལོ།
en: without seeking even the slightest benefit for myself.

source: །གང་ཡང་དག་པར་སྤོང་བའང་སྤྱོད་ཡུལ་ལ་དགེ་བ་དང་མི་དགེ་བ་གཉིས་སུ་དམིགས་པའང་སྤྱོད་ཡུལ་མ་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of the four right efforts, where the duality of good and evil is not apprehended, such is the domain of the bodhisattva.

source: སེམས་ཅན་ཐམས་ཅད་ལ་བདག་གིས་ཕན་པར་བྱ་སྟེ།
en: ‘I must benefit all living beings,

source: སེམས་དང་། ཡིད་དང་། རྣམ་པར་ཤེས་པ་དང་བྲལ་བ།
en: It is without ideation, because it is free of mind, thought, or consciousness.

source: །བརྒྱད་གང་ཞེ་ན།
en: What are the eight?

source: གཉེན་པོ་མེད་པའི་ཕྱིར་འདྲ་བ་མེད་པ།
en: It is incomparable, because it has no antithesis.

source: །གང་རྫུ་འཕྲུལ་གྱི་རྐང་པ་སྒྲུབ་པའང་སྤྱོད་ཡུལ་ལ་ལྷུན་གྱིས་གྲུབ་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་ལ་དབང་སྒྱུར་བའང་སྤྱོད་ཡུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of the four bases of magical powers, where they are effortlessly mastered, such is the domain of the bodhisattva.

source: །གང་དབང་པོ་ལྔའི་ཡང་སྤྱོད་ཡུལ་ལ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པའང་སྤྱོད་ཡུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of the five spiritual faculties, where one knows the degrees of the spiritual faculties of living beings, such is the domain of the bodhisattva.

source: །གང་སྟོབས་ལྔ་ལ་གནས་པའང་སྤྱོད་ཡུལ་ལ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལ་མངོན་པར་དགའ་བ་ཡང་སྤྱོད་ཡུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of living with the five powers, where one delights in the ten powers of the tathāgata, such is the domain of the bodhisattva.

source: །གང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ཡོངས་སུ་གྲུབ་པའང་སྤྱོད་ཡུལ་ལ་བློ་རབ་ཏུ་དབྱེ་བ་ཤེས་པ་ལ་མཁས་པའང་སྤྱོད་ཡུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of perfection of the seven factors of enlightenment, where one is skilled in the knowledge of fine intellectual distinctions, such is the domain of the bodhisattva.

source: ཆོས་བརྒྱད་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདི་ནས་ཤི་འཕོས་ནས་མ་རྨས་མ་སྣད་པར་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་འགྲོ་བར་འགྱུར་རོ།
en: “After he transmigrates at death away from this Sahā universe, a bodhisattva must have eight qualities to reach a pure buddhafield safe and sound.

source: རྒྱུ་དང་མི་འཐུན་ཞིང་རྐྱེན་དུ་སྒྲོ་འདོགས་པ་མེད་པ།
en: It is without presumption of conditionality, because it does not conform to causes.

source: །གང་ལམ་ལ་གནས་པའང་སྤྱོད་ཡུལ་ལམ་ངན་པ་ལ་མི་དམིགས་པའང་སྤྱོད་ཡུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of living by the eightfold path, without even perceiving any evil paths, such is the domain of the bodhisattva.

source: ཆོས་ཀྱི་དབྱིངས་སུ་ཡང་དག་པར་འདུ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་མཉམ་པར་གཞག་པ།
en: “ ‘It permeates evenly all things, because all are included in the ultimate realm.

source: །གང་ཞི་གནས་དང་། ལྷག་མཐོང་གི་ཚོགས་ཚོལ་བ་ཡང་སྤྱོད་ཡུལ་ལ་ཤིན་ཏུ་ཞི་བར་མི་ལྟུང་བ་ཡང་སྤྱོད་ཡུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of the cultivation of the aptitude for mental quiescence and transcendental analysis, where one does not fall into extreme quietism, such is the domain of the bodhisattva.

source: རྗེས་སུ་མི་འགྲོ་བའི་ཚུལ་གྱིས་དེ་བཞིན་ཉིད་ཀྱི་རྗེས་སུ་སོང་བ།
en: It conforms to reality by means of the process of nonconformity.

source: ངའི་བ་མེད་པ། ང་ཡིར་འཛིན་པ་མེད་པ། རྣམ་པར་རིག་པ་མེད་པ་སྟེ།
en: It is without the concept of “mine,” because it is free of the habitual notion of possession.

source: །ཁྱོད་ཀྱིས་སེམས་ཅན་གྱི་དབང་པོ་ལ་མཁས་པར་བྱའོ།
en: You should be adept in regard to the spiritual faculties of living beings.

source: ཆོས་དུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདི་ནས་ཤི་འཕོས་ནས་མ་རྨས་མ་སྣད་པར་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་འགྲོ་བར་འགྱུར། སྨྲས་པ།
en: “How many qualities must a bodhisattva have, to go safe and sound to a pure buddhafield after he transmigrates at death away from this Sahā universe?” Vimalakīrti replied,

source: །ཤེས་རབ་ཀྱི་མིག་གིས་ལེགས་པར་མཐོང་བ་དང་།
en: By means of the correct vision of the wisdom-eye,

source: སྙིང་རྗེ་ཆེན་པོ་མངོན་དུ་གྱུར་པ་དང་།
en: manifesting the great compassion,

source: ཐེག་པ་ཆེན་པོའི་བསྔགས་པ་བརྗོད་པ་དང་།
en: acknowledging the benevolent activity of the Buddha,

source: དགེ་བ་བསགས་པའི་ཆོས་བཅུ་པོ་འདི་དག་རབ་ཏུ་འཛིན་པར་འགྱུར་བ་དེ་དག་ནི་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་ན་མེད་དོ།
en: Those who engage in these ten virtuous practices do not exist in any other buddhafield.”

source: །བསྡུ་བའི་དངོས་པོ་བཞིས་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་སྟེ།
en: and to develop living beings without interruption through the four means of unification.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བ་མེད་པ་དང་།
en: I must have no resentment toward any living being.

source: སངས་རྒྱས་ལ་བྱས་པ་གཟོ་བ་དང་། བསམ་པ་དག་པ་དང་། ཆོས་ཀྱི་ངེས་པའི་ཚིག་རྣམ་པར་ཤེས་པས་
en: purifying your intentions, and understanding the definitive expressions of the Dharma,

source: དཀོན་མཆོག་གསུམ་གྱི་རིགས་མི་འཆད་པར་བྱ་བའི་ཕྱིར་ཁྱོད་ཀྱིས་ཆོས་བསྟན་པར་བྱའོ་ཞེས་མཆི་སྟེ།
en: you should teach the Dharma in order that the continuity of the Three Jewels may never be interrupted.’

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་སྟོན་པ་ལྟ་བུར་དགའ་བ་དང་།
en: I must rejoice in all bodhisattvas as if they were the Teacher.

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་དེ་ལྟ་བུར་དེས་ཆོས་བསྟན་པས་ཁྱིམ་བདག་གི་འཁོར་དེ་ལས་ཁྱིམ་བདག་བརྒྱད་བརྒྱ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ།
en: “Lord, when Vimalakīrti had discoursed thus, eight hundred householders in the crowd conceived the spirit of unexcelled, perfect enlightenment,

source: བཅོམ་ལྡན་འདས་དེའི་སླད་དུ་བདག་སྐྱེས་བུ་དམ་པ་དེའི་བྲོ་འདྲི་ཞིང་མཆི་བར་མི་སྤྲོའོ།
en: Therefore, Lord, I am indeed reluctant to go to this good man to inquire about his illness.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་ལ་བཀའ་སྩལ་པ།
en: The Buddha then said to the venerable Mahākāśyapa,

source: འོད་སྲུང་ཁྱོད་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པའི་ནད་འདྲིར་སོང་ཤིག
en: “Mahākāśyapa, you go to the Licchavi Vimalakīrti to inquire about his illness.”

source: །གང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཚུལ་སྟོན་པ་ཡང་སྤྱོད་ཡུལ་ལ་སངས་རྒྱས་ཀྱི་ཆོས་ལས་མི་ཉམས་པ་ཡང་སྤྱོད་ཡུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of manifesting the attitudes of the disciples and the solitary sages without sacrificing the qualities of the Buddha, such is the domain of the bodhisattva.

source: །བདག་ཀྱང་སྤོབས་པ་མ་མཆིས་པར་གྱུར་ཏེ།
en: and I myself was speechless.

source: །གང་ཆོས་ཐམས་ཅད་སྐྱེད་པ་མེད་པའི་མཚན་ཉིད་དུ་རྟོག་པ་ཡང་སྤྱོད་ཡུལ་ལ་མཚན་དང་དཔེ་བྱད་བཟང་པོ་དང་། སངས་རྒྱས་ཀྱི་སྐུ་དང་རྒྱན་ཡོངས་སུ་སྒྲུབ་པའང་སྤྱོད་ཡུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of the realization of the unborn nature of all things, yet of the perfection of the body, the auspicious signs and marks, and the ornaments of the Buddha, such is the domain of the bodhisattva.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བདག་གིས་མངོན་པར་འཚལ་བ་དུས་གཅིག་ན།
en: Why? I remember one day,

source: དབུལ་པོའི་སྲང་དུ་བསོད་སྙོམས་ལ་མཆིས་ན་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་དེར་མཆིས་ནས་བདག་ལ་འདི་སྐད་ཅེས་མཆིའོ།
en: when I was in the street of the poor begging for my food, the Licchavi Vimalakīrti came along and said to me,

source: །གང་རང་བཞིན་རབ་ཏུ་རྣམ་པར་དག་པར་གྱུར་པའི་ཆོས་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འགྲོ་བའང་སྤྱོད་ཡུལ་ལ་སེམས་ཅན་ཐམས་ཅད་ཇི་ལྟར་མོས་པ་བཞིན་དུ་སྤྱོད་ལམ་སྟོན་པ་ཡང་སྤྱོད་ཡུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain of conformity to all things utterly pure in nature while manifesting behavior that suits the inclinations of all living beings, such is the domain of the bodhisattva.

source: གཞན་གྱི་རྙེད་པ་ལ་ཕྲག་དོག་མེད་ཅིང་བདག་གི་རྙེད་པས་མི་སྙེམས་ཤིང་སེམས་ངེས་པར་སེམས་པ་དང་།
en: I must control my mind, without coveting the gains of others, and without taking pride in gains of my own.

source: བདག་གི་འཁྲུལ་པ་ལ་སོ་སོར་རྟོག་ཅིང་གཞན་གྱི་ཉེས་པ་མི་གླེང་བ་དང་།
en: I must examine my own faults and not blame others for their faults.

source: བག་ཡོད་པ་ལ་དགའ་ཞིང་ཡོན་ཏན་ཐམས་ཅད་ཡང་དག་པར་ལེན་པ་སྟེ།
en: I must take pleasure in being consciously aware and must truly undertake all virtues.’

source: ཆོས་བརྒྱད་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ནས་ཤི་འཕོས་ནས་མ་རྨས་མ་སྣད་པར་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་འགྲོ་བར་འགྱུར་རོ།
en: “If a bodhisattva has these eight qualities, when he transmigrates at death away from the Sahā universe, he will go safe and sound to a pure buddhafield.”

source: །དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་དང་།
en: When the Licchavi Vimalakīrti and

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་དེ་ལྟར་འཁོར་དེར་འདུས་པ་ལ་དེ་ལྟར་ཆོས་བསྟན་པས་འདི་ལྟར་སྲོག་ཆགས་འབུམ་ཚང་བ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ།
en: the crown prince Mañjuśrī had thus taught the Dharma to the multitude gathered there, one hundred thousand living beings conceived the spirit of unexcelled, perfect enlightenment,

source: །བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: and ten thousand bodhisattvas attained the tolerance of the birthlessness of things.

source: །གང་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ་དང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་སྟོན་པ་ཡང་སྤྱོད་ཡུལ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མ་གཏོང་བ་ཡང་སྤྱོད་ཡུལ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ལོ།
en: The domain where one turns the wheel of the holy Dharma and manifests the magnificence of ultimate liberation, yet never forsakes the career of the bodhisattva, such is the domain of the bodhisattva!”

source: །དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་སེམས་ཀྱི་རྟོག་པ་ཤེས་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The Licchavi Vimalakīrti read the thought of the venerable Śāriputra and said,

source: ཐོས་པ་དང་མ་ཐོས་པའི་ཆོས་རྣམས་ཐོས་ན་མི་སྤོང་བ་དང་།
en: I must not neglect any teachings, whether or not I have heard them before.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་ཅི་ཆོས་འདོད་དེ་འོངས་སམ། འོན་ཏེ་སྟན་འདོད།
en: “Reverend Śāriputra, did you come here for the sake of the Dharma? Or did you come here for the sake of a chair?”

source: །།ཡང་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཨ་མྲ་སྲུང་བའི་ཚལ་ན་ཆོས་སྟོན་པའི་འཁོར་གྱི་ཁྱམས་དེ་ཡང་རྒྱ་ཆེ་ཞིང་ཡངས་པར་གྱུར་ཏོ།
en: Meanwhile, the area in which the Lord was teaching the Dharma in the garden of Āmrapālī expanded and grew larger,

source: །འཁོར་དེ་ཡང་གསེར་གྱི་ཁ་དོག་ལྟ་བུར་འདུག་གོ།
en: and the entire assembly appeared tinged with a golden hue.

source: །སངས་རྒྱས་ཀྱི་རིགས་ཀྱིས་ཁྱོད་ཁྱིམ་དུ་འགྲོ་བར་བྱའོ།
en: You should enter homes as if entering the family of the Buddha.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Thereupon, the venerable Ānanda asked the Buddha,

source: །བཅོམ་ལྡན་འདས་འདི་ལྟར་ཨ་མྲ་སྲུང་བའི་ཚལ་འདི་རྒྱ་ཆེ་ཞིང་ཡངས་པར་གྱུར་པ་དང་། འཁོར་ཐམས་ཅད་ཀྱང་གསེར་གྱི་ཁ་དོག་ཏུ་གདའ་བ་འདི་སུའི་སྔ་ལྟས་ལགས།
en: “Lord, this expansion and enlargement of the garden of Āmrapālī and this golden hue of the assembly—what do these auspicious signs portend?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Buddha declared,

source: །མི་ལེན་པས་བསོད་སྙོམས་བླང་བར་བྱའོ།
en: You should accept alms by not taking anything.

source: བཙུན་པ་ཤཱ་རིའི་བུ་གང་ཆོས་འདོད་པ་དེ་ནི་གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་འདོད་པ་མ་ཡིན་ནོ།
en: Reverend Śāriputra, he who is interested in the Dharma has no interest in matter, sensation, intellect, motivation, or consciousness.

source: །ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་འདོད་པ་མ་ཡིན་ནོ།
en: He has no interest in these aggregates, or in the elements, or in the sense-media.

source: ཀུན་དགའ་བོ་འདི་ནི་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་གཉིས་འཁོར་མང་པོས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: “Ānanda, these auspicious signs portend that the Licchavi Vimalakīrti and the crown prince Mañjuśrī, attended by a great multitude,

source: །གང་ཆོས་འདོད་པ་དེ་ནི་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་འདོད་པ་མ་ཡིན་ནོ།
en: Interested in the Dharma, he has no interest in the realm of desire, the realm of pure matter, or the immaterial realm.

source: དེ་བཞིན་གཤེགས་པའི་དྲུང་དུ་འོང་བའི་སྔ་ལྟས་སོ།
en: are coming into the presence of the Tathāgata.”

source: །གང་ཆོས་འདོད་པ་དེ་ནི་སངས་རྒྱས་ལ་མངོན་པར་ཞེན་པ་འདོད་པ་མ་ཡིན། ཆོས་དང་། དགེ་འདུན་ལ་མངོན་པར་ཞེན་པ་འདོད་པ་མ་ཡིན་ནོ།
en: Interested in the Dharma, he is not interested in attachment to the Buddha, attachment to the Dharma, or attachment to the Saṅgha.

source: །འཇམ་དཔལ་གྱིས་སྨྲས་པ།
en: Mañjuśrī replied,

source: རིགས་ཀྱི་བུ་དག་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་འདོང་ངོ་།
en: “Noble sir, send them if you feel the time is right!”

source: །བཙུན་པ་ཤཱ་རིའི་བུ་གཞན་ཡང་གང་ཆོས་འདོད་པ་དེ་ནི་སྡུག་བསྔལ་ཡོངས་སུ་ཤེས་པར་འདོད་པ་མ་ཡིན། ཀུན་འབྱུང་བ་སྤང་བར་འདོད་པ་མ་ཡིན། འགོག་པ་མངོན་དུ་བྱ་བར་འདོད་པ་མ་ཡིན། ལམ་བསྒོམ་པར་འདོད་པ་མ་ཡིན་ནོ།
en: Reverend Śāriputra, he who is interested in the Dharma is not interested in recognizing suffering, abandoning its origination, realizing its cessation, or practicing the path.

source: །དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་འདི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུ་བྱས་པས་ཇི་ལྟར་འཁོར་ཐམས་ཅད་
en: Thereupon the Licchavi Vimalakīrti performed the miraculous feat of placing the entire assembly,

source: སེང་གེའི་ཁྲི་དེ་དག་དང་བཅས་ཏེ་ལག་པ་གཡས་པའི་སྟེང་དུ་བཞག་ནས།
en: replete with thrones, upon his right hand and

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་དེར་ཕྱིན་པ་དང་། དེ་དག་ས་ལ་བཞག་སྟེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས།
en: then, having transported himself magically into the presence of the Buddha, placing it on the ground. He bowed down at the feet of the Buddha,

source: བཅོམ་ལྡན་འདས་ལ་ལན་བདུན་དུ་བསྐོར་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: circumambulated him to the right seven times with palms together, and withdrew to one side.

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་སྤོས་མཆོག་བརྩེགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་ལྷགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་སེང་གེའི་ཁྲི་ལས་བབས་ཏེ།
en: The bodhisattvas who had come from the buddhafield of the Tathāgata Gandhottama­kūṭa descended from their lion-thrones and,

source: །གྲོང་སྟོང་པར་བྱིན་གྱིས་བརླབས་ཏེ་ཁྱོད་གྲོང་དུ་འཇུག་པར་བྱའོ།
en: When you enter a town, you should keep in mind its actual voidness,

source: ། སྐྱེས་པ་དང་བུད་མེད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཁྱོད་གྲོང་ཁྱེར་དུ་འཇུག་པར་བྱའོ།
en: yet you should proceed through it in order to develop men and women.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་ལ་ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་འཚལ་ཞིང་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: bowing down at the feet of the Buddha, placed their palms together in reverence and withdrew to one side.

source: །ཟས་མེད་པར་ཟས་བཙལ་བར་བྱའོ།
en: You should beg your food in awareness of the ultimate nonexistence of food.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་།
en: And the other bodhisattvas, great spiritual heroes,

source: །དམུས་ལོང་དང་མཚུངས་པར་གཟུགས་རྣམས་ལ་བལྟའོ། །བྲག་ཅ་དང་འདྲ་བར་སྒྲ་རྣམས་མཉན་ཏོ།
en: You should see form like a man blind from birth, hear sounds as if they were echoes,

source: ཉན་ཐོས་ཆེན་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་སེང་གེའི་ཁྲི་ལས་བབས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: and the great disciples descended from their thrones likewise and, having bowed at the feet of the Buddha, withdrew to one side.

source: །གཞན་གྱི་རིལ་པོར་འཛིན་པ་བཙལ་བའི་ཕྱིར་ཁྱོད་བསོད་སྙོམས་ལ་འགྲོ་བར་བྱའོ།
en: You should seek alms for the sake of eliminating the materialism of others.

source: ། དུས་ཐམས་ཅད་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་བསམས་ཏེ་བསོད་སྙོམས་བཙལ་བར་བྱའོ།
en: and you should seek alms with consideration for all living beings at all times.

source: །འདི་ལྟར་སེམས་ཅན་ཆེན་པོའི་ཁྱིམ་བཀོལ་ཏེ་དབུལ་པོའི་ཁྱིམ་རྣམས་སུ་འགྲོ་བ་ནི་བཙུན་པ་འོད་སྲུང་ཆེན་པོའི་བྱམས་པ་ཕྱོགས་གཅིག་པ་ཡིན་གྱི་བཙུན་པ་འོད་སྲུང་ཆེན་པོ་ཆོས་མཉམ་པ་ཉིད་ལ་གནས་པར་བྱའོ།
en: ‘Reverend Mahākāśyapa, to avoid the houses of the wealthy, and to favor the houses of the poor—this is partiality in benevolence. Reverend Mahākāśyapa, you should dwell on the fact of the equality of things,

source: །རླུང་དང་མཚུངས་པར་དྲི་རྣམས་མནམ་མོ།
en: smell scents as if they were winds,

source: །རྣམ་པར་རིག་པ་མེད་པས་རོ་རྣམས་མྱང་ངོ་།
en: experience tastes without any discrimination,

source: །ཡེ་ཤེས་ལ་རེག་པ་མེད་པས་རེག་བྱ་རྣམས་ལ་རེག་པར་བྱའོ།
en: touch tangibles in awareness of the ultimate lack of contact in gnosis,

source: །སྒྱུ་མའི་སྐྱེས་བུའི་རྣམ་པར་རིག་པས་ཆོས་རྣམས་ལ་རིག་པར་བྱའོ།
en: and know things with the consciousness of an illusory creature.

source: །གང་བདག་གི་དངོས་པོ་དང་གཞན་གྱི་དངོས་པོ་མེད་པ་དེ་ནི་མི་འབར་བའོ།
en: That which is without intrinsic substance and without imparted substance does not burn.

source: །གང་མི་འབར་བ་དེ་ནི་ཞི་བར་མི་འགྱུར་རོ།
en: And what does not burn will not be extinguished.

source: །དེ་བཞིན་དུ་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། ལྷའི་བུ་དེ་དག་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Likewise all those Indras, Brahmās, Lokapālas, and gods bowed at the feet of the Buddha and withdrew to one side.
